tutorials/compressible/steadyCompressibleFoam/2bump/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    INLE1
    {
        type            fixedValue;
        value           uniform 300;
    }

    OUTL2
    {
        type            zeroGradient;

//         type            waveTransmissive;
//         phi             phi;
//         rho             rho;
//         psi             psi;
//         U               U;
//         gamma           1.4;
//         inletOutlet     false;
//         correctSupercritical true;
//         lInf            0.0;
//         fieldInf        300;
    }

    WALL3
    {
        type            symmetryPlane;
    }

    WALL4
    {
        type            zeroGradient;
    }

    SYMP5
    {
        type            empty;
    }
}

// ************************************************************************* //
